# FieldDomainPointsByUV Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldDomainPointsByUV Properties
FieldDomainPointsByUV Class See Also
---
The FieldDomainPointsByUV type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FieldDomainPoints.) |

# See Also
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace